public interface iPlay {
    int SPEED = 100; // public final static ;

    public void play(); // абстрактный

/*
Названия примерно такие:
iPlay
Playable
Stopable
...
Методы бывают абстрактные
defailt
static
private

все поля финальные. Пишуться CAPSом.

Наследование интерфейсов.

Интерфейсы могут быть множественные наследования.
То, что мы не можем сделать в коассах.

есть интерфейсы Маркеры.
если в программе встречается, то это для тако чтобы начать какое то действие.
как типа Clonable
говорит что делать дальше.
Remote

@FunctionalInterface;
проверяет чтобы был только один абстрактный метод.

 */
}
